In [6]:
import numpy as np
import pandas as pd

In [7]:
df = pd.DataFrame({
    'maths' : [80, 89, 90, 20],
    'science' : [40, 50, 90, 100],
    'language' : [20, 30, 90, 95]
})

In [8]:
df

   maths  science  language
0     80       40        20
1     89       50        30
2     90       90        90
3     20      100        95

In [9]:
df_maths = df[df.maths > 50]

In [10]:
df_maths

   maths  science  language
0     80       40        20
1     89       50        30
2     90       90        90

In [11]:
df_maths

   maths  science  language
0     80       40        20
1     89       50        30
2     90       90        90